#学号: 
#姓名: 
#运行作业题的程序时将相应题目中语句前的#号删掉


#=================================作业题1========================================
"""写程序完成以下任务，请在各题号后写下或补全程序语句"""
#提示：使用abs( (0.4 - 0.1) - 0.3) < 1e-6判断0.4-0.1与0.3相等

#(1)	将复数5+12j赋值给变量x
x = 5 + 12j
#(2)	输出（使用print函数）abs(x)的类型
print(type(abs(x)))
#(3)	写一个表示式验证abs(x)的平方等于x的实部（real）和虚部（imag）的平方和
print(abs(abs(x)**2-(x.real**2 + x.imag**2)) < 1e-6)
#(4)	写一个表示式验证x.conjugate()的返回值的虚部与x的虚部互为相反数
print(abs(x.conjugate().imag + x.imag) < 1e-6)



#=================================作业题2========================================
"""将字符串'浙江工业大学zjut'转化为字节串，并print该字节串的长度"""

s = '浙江工业大学zjut'
#在下面写自己的程序
se = s.encode('utf-8')
print(len(se))
#在上面写自己的程序


#在下面写程序的输出结果
22
#在上面写程序的输出结果

#=================================作业题3========================================
"""计算下列条件表达式的值，请将______替换为返回值"""

print(([1, 2, 3] > [1, 2, 4]),'1')
# [1, 2, 3] > [1, 2, 4] 返回False
print(('ABC' < 'C' < 'Pascal' < 'Python'),'2')
# 'ABC' < 'C' < 'Pascal' < 'Python' 返回True 
print(((1, 2, 3) == (1, 2, 3.0)),'3')
# (1, 2, 3) == (1.0, 2.0, 3.0) 返回True
print(((1, 2, 3) is (1.0, 2.0, 3.0)),'4')
# (1, 2, 3) is (1.0, 2.0, 3.0) 返回False 
print((0.1 and 1),'5')
# 0.1 and 1 返回1 
print(([] or 1),'6')
# [] or 1 返回1 
print(('a' or 1),'7')
# 'a' or 1 返回`a` 



#=================================作业题4========================================
#"""使用list和range函数分别创建如下列表，并print出来：设n为一个大于零的偶数"""

n = 20
# （1）[0,n]之内的奇数从小到大形成的列表
oddList = list(range(1, n+1, 2))
print(oddList)

# (2) [0,n]之内的偶数从小到大形成的列表
evenList = list(range(0, n+1, 2))
print(evenList)

# 作业题4的第(3)(4)小题按要求要用使用list和range函数分别创建

# (3） [0,n]之内的奇数从大到小形成的列表
oddListReverse = list(range(n-1, 0, -2))
print(oddListReverse)

# (4） [0,n]之内的偶数从大到小形成的列表
evenListReverse = list(range(n, -1, -2))
print(evenListReverse)

#=================================作业题5========================================
"""设s为一个字符串变量，使用内置函数计算s中各不相同的字符的个数，并print出来"""

s = 'abjjiabcdji123fgh'
#在下面写自己的程序
for i in s:
    count = s.count(i)
    if count > 0:
        print(i, count)
##  要求用内置函数，lst.count()不是内置函数，是类的方法，本题答案print(len(set(s)))
print(len(set(s)))
#在上面写自己的程序



#=================================作业题6========================================
"""设有列表a = [0,[0,0],[0,0]]，请补全下面的5条赋值语句，使a变为[1,[2,3],[4,5]]"""

a = [1,[0,0],[0,0]]
#在下面写自己的程序
a[0] = 1
a[1][0] = 2
a[1][1] = 3
a[2][0] = 4
a[-1][-1] = 5
#在上面写自己的程序

print(a)




