#学号:
#姓名:
#运行作业题的程序时将相应题目中语句前的#号删掉

# %%
#=============作业4.3.1======================


import random
#=================================作业题1========================================
"""使用random库中的choice函数生成包含从'abcd'中选取的10个随机字符的列表a。请使用for循环实现。"""
a = []
#在下面写自己的程序
for i in range(10):
    a.append(random.choice('abcd'))
#在上面写自己的程序
print(a)

#=================================作业题2========================================
"""使用循环与index方法将上面生成列表a中’a’的下标存到列表b。请使用for循环实现。"""

b = []
#在下面写自己的程序
start = 0
for _ in range(a.count('a')):
    idx = a.index('a', start)
    b.append(idx)
    start = idx + 1
#在上面写自己的程序
print(b)


#=================================作业题3========================================
"""使用循环和remove方法删除上面生成列表a中所有的’a’（提示：使用count方法）"""
#在下面写自己的程序
for i in range(a.count('a')):
    a.remove('a')
#在上面写自己的程序
print(a)



# %%

#=============作业4.3.2======================

import random

#=================================作业题1========================================
#设aList = list(range(2,12)),下列切片的值为？请大家手算结果，把答案写在空行里，答案以井号注释掉。
#aList[1:9:2]
# [3, 5, 7, 9]
#aList[1:-1:2]
# [3, 5, 7, 9]
#aList[:3]
# [2, 3, 4]
#aList[-3:]
# [9, 10, 11]
#aList[:]
# [2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
#aList[::]
# [2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
#aList[::-1]
# [11, 10, 9, 8, 7, 6, 5, 4, 3, 2]
#aList[9:0:-1]
# [11, 10, 9, 8, 7, 6, 5, 4, 3]
#aList[-1:0:-1]
# [11, 10, 9, 8, 7, 6, 5, 4, 3]
#aList[0:100]
# [2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
#aList[100:]
# []
# aList[-15:3]
# [2, 3, 4]


#=================================作业题2和3========================================
"""请使用列表推导式实现"""

#设a是一个整数列表，写列表推导式，得到或实现：
a = [random.randrange(20) for i in range(20)]
print(a)
#1. a中的奇数的平方所构成列表
b = [x**2 for x in a if x % 2 == 1]
print(b)
#2. a中的奇数的下标所构成列表
b = [idx for idx, val in enumerate(a) if val % 2 == 1]
print(b)
#3. 判断a中数是否都是偶数
b = all(x % 2 == 0 for x in a)
print(b)
#4. 判断a中的数是否至少有一个是偶数
b = any(x % 2 == 0 for x in a)
print(b)

# 设a和b是两个列表，写列表推导式，得到
b = [random.randrange(20) for i in range(20)]
#a和b相同位置上的元素不相同时相减所构成的列表
print([x - y for x, y in zip(a, b) if x != y])
#判断a和b相同位置上的元素之差的绝对值是否都小于1.0e-7
print(all(abs(x - y) < 1.0e-7 for x, y in zip(a, b)))


