#学号: 
#姓名: 
#运行作业题的程序时将相应题目中语句前的#号删掉


#=================================作业题1========================================
#设n为1000以内的整数，将n分解为素数因子之积，如n=12,则输出(print) 12=2*2*3
#程序中可以使用1000以内素数的列表pn

from random import randrange
n = randrange(1000)

pn = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73,
79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 
173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 
269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367, 
373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 
467, 479, 487, 491, 499, 503, 509, 521, 523, 541, 547, 557, 563, 569, 571, 577, 587, 
593, 599, 601, 607, 613, 617, 619, 631, 641, 643, 647, 653, 659, 661, 673, 677, 683, 
691, 701, 709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809, 811, 
821, 823, 827, 829, 839, 853, 857, 859, 863, 877, 881, 883, 887, 907, 911, 919, 929, 
937, 941, 947, 953, 967, 971, 977, 983, 991, 997]

#在下面写自己的程序

origin_n = n

if n < 2:
    print(f"{origin_n} 没有质因子")
else:
    factors = []
    temp_n = n
    for prime in pn:
        if prime * prime <= n:
            while temp_n % prime == 0:
                factors.append(str(prime))
                temp_n //= prime
    if n > 1:
        factors.append(str(n))

    print(f"{origin_n}=" + "*".join(factors))

#在上面写自己的程序


#=================================作业题2========================================
#至少使用两种不同的方法计算100以内所有奇数的和

#方法一
#在下面写自己的程序
sum = 0
for i in range(1, 100, 2):
    sum += i
print(sum)
#在上面写自己的程序


#方法二
#在下面写自己的程序
# 等差数列求和公式法
total = (1 + 99) /2 * (1 + 99) /2
print(total)
#在上面写自己的程序




#=================================作业题3========================================
#实现分段函数的计算：
"""
    分段函数计算
    y = {
        0,           x < 0
        x,           0 <= x < 5
        3x - 5,      5 <= x < 10
        0.5x - 2,    10 <= x < 20
        0,           x >= 20
    }
"""
def myfun(x):
    y = None

    if x<0:
        y = 0
    elif 0 <= x < 5:
        y = x
    elif 5 <= x < 10:
        y = 3*x - 5
    elif 10 <= x < 20:
        y = 0.5*x - 2
    else:
        y = 0
    return y

print(myfun(5.1))








