#学号:
#姓名:
#运行作业题的程序时将相应题目中语句前的#号删掉

import random
#=================================作业题1========================================
"""使用random库中的choice函数生成包含从'abcd'中选取的10个随机字符的列表a。请使用for循环实现。"""
a = []
#在下面写自己的程序

#在上面写自己的程序
print(a)

#=================================作业题2========================================
"""使用循环与index方法将上面生成列表a中’a’的下标存到列表b。请使用for循环实现。"""

b = []
#在下面写自己的程序

#在上面写自己的程序
print(b)



#=================================作业题3========================================
"""使用循环和remove方法删除上面生成列表a中所有的’a’（提示：使用count方法）"""
#在下面写自己的程序

#在上面写自己的程序
print(a)


#=================================作业题4========================================
"""请在[]内填入列表推导式"""

#设a是一个整数列表，写列表推导式，得到或实现：
a = [random.randrange(20) for i in range(20)]
print(a)
#1. a中的奇数的平方所构成列表
print([])
#2. a中的奇数的下标所构成列表
print([])
#3. 判断a中数是否都是偶数
print([])
#4. 判断a中的数是否至少有一个是偶数
print([])

# 设a和b是两个列表，写列表推导式，得到
#5.a和b相同位置上的元素不相同时相减所构成的列表
print([])
#6. 判断a和b相同位置上的元素之差的绝对值是否都小于1.0e-7
print([])




