#学号: 302024343017
#姓名: 沈宽
#运行作业题的程序时将相应题目中语句前的#号删掉


import random
#=================================作业题1========================================
"""创建一个字典d，键为26个小写英文字母，值为区间[0,10]中的随机整数"""
d = {}
#在下面写自己的程序
for i in 'abcdefghijklmnopqrstuvwxyz':
    d[i] = random.randint(0,10)
#在上面写自己的程序
print(d)

#=================================作业题2========================================
"""print字典d的值的最大值、最小值、平均值"""

#在下面写自己的程序
print(max(d.values()))
print(min(d.values()))
print(sum(d.values())/len(d))
#在上面写自己的程序


#=================================作业题3========================================
"""使用列表推导式生成在[6,9]区间内的值所对应的键组成的列表a"""
#在下面写自己的程序
a=([i for i in d.keys() if 5<d[i]<10])
#在上面写自己的程序
print(a)


#=================================作业题4========================================
"""设a和b是两个列表，利用集合运算写表达式判断"""

a = [1]
b = [1,2,3,4]
#(1)a的所有元素都属于b，
print(set(a)<=set(b))
# （2）a的所有元素都不属于b
print(0==len((set(a)&set(b))))

# （3）a有至少一个元素属于b
print(len(set(a)&set(b))>0)